# 2018 - 09 - 27 (jueves)

### Entrega proyectos

---

# SQL

La clase pasada cargamos una base de datos con 2 tablas:
- mis_datos
- tabla_nombres

Descargar aqui si no la tienen: https://www.dropbox.com/s/tejs4qpkp06q3ka/data_sql.db?dl=0

In [9]:
#probar esta celda, para ver si tienen libreria pymysql
import pymysql.cursors

### Carga datos clase pasada

In [ ]:
import pandas as pd
import sqlite3

#leo los datos
db_path = r'../clase11_20180925/data_sql.db'
db_conn = sqlite3.connect(db_path)

"Veamos" los datos primero...

In [5]:
sql_query = ''

data = pd.read_sql(sql_query, db_conn)
display(data)

   index  year  quarter  valor
0      0  2010        1      3
1      1  2010        2      6
2      2  2010        3      8
3      3  2010        4      1
4      4  2011        1      4
5      5  2011        2      3
6      6  2011        3      7
7      7  2011        4     70

Ejercicio clase pasada: "Calcule el promedio de "valor" para cada año, considerando sólo el "valor" de los dos primeros trimestres de cada año."

In [ ]:
sql_query = ''

data = pd.read_sql(sql_query, db_conn)
display(data)

### Ejemplos "join"

Calcule el promedio de "valor" para cada trimestre, usando el nombre del trimestre

```
SELECT nombre, AVG(valor)
FROM mis_datos
    INNER JOIN tabla_nombres ON mis_datos.quarter = tabla_nombres.quarter
GROUP BY nombre

```

Identifique los años/trimestres (con el "nombre" del trimestre) donde "valor" haya sido mayor a 5

```
SELECT year, nombre
FROM mis_datos
    INNER JOIN tabla_nombres ON mis_datos.quarter = tabla_nombres.quarter
WHERE valor > 5

```

In [6]:
sql_query = '''
    SELECT year, nombre
    FROM mis_datos
        INNER JOIN tabla_nombres ON mis_datos.quarter = tabla_nombres.quarter
    WHERE valor > 5
'''

data = pd.read_sql(sql_query, db_conn)
display(data)

   year   nombre
0  2010  Segundo
1  2010  Tercero
2  2011  Tercero
3  2011   Cuarto

# Un ejemplo más real...

En este ejemplo, nos conectaremos a un servidor de datos real, que tiene dos tablas:

- casen: datos de la casen 2017
- casen2015: datos de la casen 2015

Nota: Este servidor de datos usa el motor "MySQL", por lo que la sintaxis para ciertas cosas puede ser distinta a la sintaxis de SQLite3.

In [5]:
#usando datos en servidor

import pandas as pd

#en este ejemplo, el servidor de datos es MySQL, por lo que usamos 
#libreria pymysql para administrar la conexion
import pymysql.cursors

#cargamos funcion "display", para ver los DataFrame de pandas formateados
from IPython.display import display

#datos de conexion al servidor (muy similar a lo que es un "path")
host = '190.107.176.7'
user = 'reportej_alum'
passwd = 'clave_alumno2018'
database = 'reportej_eae253b'

# Creamos una conexion a la base de datos
connection = pymysql.connect(host=host,
                             user=user,
                             password=passwd,
                             db=database,)

      y            p1
0  2015  9.783021e+05
1  2017  1.099658e+06

In [ ]:
# definimos la query que queremos ejecutar. En este caso, saber cuantas filas
# tiene la base de datos
query = '''
    
'''

df_cuenta = pd.read_sql(query, connection)

display(df_cuenta)

### SQL Injection

In [16]:
sql_query = '''
    SELECT year, nombre
    FROM mis_datos
        INNER JOIN tabla_nombres USING (quarter)
    WHERE valor > ?
'''

data = pd.read_sql(sql_query, db_conn, params=[3])
display(data)

   year   nombre
0  2010  Segundo
1  2010  Tercero
2  2011  Primero
3  2011  Tercero
4  2011   Cuarto